<?php
/*
 *  Если переменная $a равна нулю или равна двум, то прибавьте к ней 7, иначе поделите ее на 10.
 *  Выведите новое значение переменной на экран.
 * Проверьте работу скрипта при $a, равном 5, 0, -3, 2.
 */
$a = 5;
if ($a == 0 || $a == 2){
    $a  +=7;
}else {
    $a /= 10;
}
echo $a;
echo "<hr/>";
$a = 0;
if ($a == 0 || $a == 2){
$a  +=7;
}else {
    $a /= 10;
}
echo $a;
echo "<hr/>";
$a = -3;
if ($a == 0 || $a == 2){
    $a  +=7;
}else {
    $a /= 10;
}
echo $a;
echo "<hr/>";
$a = 2;
if ($a == 0 || $a == 2){
    $a  +=7;
}else {
    $a /= 10;
}
echo $a;
echo "<hr/>";